{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.8.0", "signature": {"inputs": {"random_forest_model_1/1355:0": {"name": "random_forest_model_1/1355:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1259}, "args_0_1:0": {"name": "args_0_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_3:0": {"name": "args_0_3:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0:0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_2:0": {"name": "args_0_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "80"}]}}}}, "modelTopology": {"node": [{"name": "args_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_3", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "random_forest_model_1/1355", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Func/random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_7", "op": "NoOp", "input": ["^args_0", "^args_0_2", "^args_0_1", "^args_0_3", "^random_forest_model_1/1355"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast", "op": "Cast", "input": ["args_0_3", "^Func/random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_7"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Const", "op": "Const", "input": ["^Func/random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_7"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}, {}]}}}}}, {"name": "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Const_1", "op": "Const", "input": ["^Func/random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_7"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}, {}]}}}}}, {"name": "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/values", "op": "Const", "input": ["^Func/random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_7"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const", "op": "Const", "input": ["^Func/random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_7"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const_1", "op": "Const", "input": ["^Func/random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_7"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stack", "op": "Pack", "input": ["args_0", "args_0_2", "args_0_1", "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast"], "attr": {"axis": {"i": "1"}, "N": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/inference_op", "op": "SimpleMLInferenceOpWithHandle", "input": ["random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stack", "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Const", "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Const_1", "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/values", "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const", "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const_1", "random_forest_model_1/1355"], "attr": {"_has_manual_control_dependencies": {"b": true}, "dense_output_dim": {"i": "80"}}}, {"name": "Identity", "op": "Identity", "input": ["random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/inference_op"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "modelInitializer": {"node": [{"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "1455", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "op": "SimpleMLCreateModelResource", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8"], "attr": {"container": {"s": ""}, "shared_name": {"s": "c2ltcGxlX21sX21vZGVsXzU0ZjU2MjkwLTY3ZmItNGViZS05YTk2LTBmNmIxZGNmNjAzOF9sb2FkXzEwMDc="}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_2", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/output/_1", "op": "Identity", "input": ["StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input_control_node/_3", "op": "NoOp", "input": ["^1455", "^Func/StatefulPartitionedCall/output/_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input/_5", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_5", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input/_4", "op": "Identity", "input": ["1455", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_4", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace", "op": "StaticRegexReplace", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12"], "attr": {"rewrite": {"s": ""}, "pattern": {"s": "NDc4ZDJlNmE4MGQwNDIwOGRvbmU="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle", "op": "SimpleMLLoadModelFromPathWithHandle", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace"], "attr": {"output_types": {"list": {}}, "allow_slow_inference": {"b": true}, "file_prefix": {"s": "NDc4ZDJlNmE4MGQwNDIwOA=="}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15", "op": "NoOp", "input": ["^StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/output_control_node/_7", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2", "^Func/StatefulPartitionedCall_1/output_control_node/_7"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/output_control_node/_7", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}], "versions": {"producer": 1482}}, "initializerSignature": {"outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1259}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Const", "shape": [0, 0], "dtype": "float32"}, {"name": "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Const_1", "shape": [0, 0], "dtype": "int32"}, {"name": "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/values", "shape": [0], "dtype": "int32"}, {"name": "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const", "shape": [1], "dtype": "int32"}, {"name": "random_forest_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const_1", "shape": [1], "dtype": "int32"}, {"name": "1455", "shape": [], "dtype": "string"}]}]}